Revit 2026 API

# AnalyticalMemberSplit Method

---

Splits the analytical member at a point on its defining curve.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId Split(
	double parameter
)
```
```vb
Public Function Split (
	parameter As Double
) As ElementId
```
```cpp
public:
ElementId^ Split(
	double parameter
)
```
```fsharp
member Split :
        parameter : float -> ElementId
```

#### Parameters

parameter Double
     The normalized parameter value along the element (should be greater than 0 and less than 1).

#### Return Value

ElementId The newly created analytical member id.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Analytical member cannot be split. |

Analytical members that are not a line or an arc are not permitted. See CanSplit to determine if the analytical member is allowed to be split by this method.

#### Reference

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace